# Gaps Self Joins Lab

### Introduction

In this lesson, we can take on a classic problem of finding gaps in a sequence of numbers.  Let's get started.

### Loading data

We can begin by loading our sequence of numbers.

In [15]:
import pandas as pd
import sqlite3
conn = sqlite3.connect('users.db')
root_url = "https://raw.githubusercontent.com/tech-interviews-jigsaw/sql-advanced-joins/main/6-common-strategies/"
custom = "simple_sequence.csv"
df = pd.read_csv(f"{root_url}/{custom}")

In [16]:
df.to_sql('numbers', conn, index = True,
          index_label = 'id', if_exists = 'replace')

14

In [4]:
pd.read_sql("select * from numbers", conn)

    id  number
0    0       1
1    1       2
2    2       3
3    3       5
4    4       6
5    5       7
6    6       8
7    7       9
8    8      10
9    9      12
10  10      13
11  11      14
12  12      15
13  13      17

If you look at the list of numbers above, we can see that there are gaps in the numbers of 4, 11, and 16.  Your task is to return a list of these numbers.

### Using self joins

In [14]:
query = """

"""
pd.read_sql(query, conn)

# 	gap_num
# 0	4
# 1	11
# 2	16

   gap_num
0        4
1       11
2       16